{
    "Header":{
        "Home":"Acceuil",
        "Game":"Jeux",
        "About":"À Propos",
        "UFLF":"UFLF",
        "Bambooza":"Bambooza",
        "Language":"Anglais"

    },
    "Home":{
        "Presentation":"Je suis un étudiant récemment diplômé en informatique passionné par le développement de jeux vidéo et le gameplay. Mon parcours académique m'a fourni une solide base en programmation et en conception de logiciels, que je suis désireux d'appliquer dans l'industrie du jeu pour créer des expériences de jeu exceptionnelles.",
        "MyGame": "Mes jeux"
    },
    "Games":{
        "UFLF":{
            "CompleteTitle":"L'union fait la forge",
            "SmallDescription": "L'union fait la forge ou UFLF est un jeux qui a été fait pendant mon cours d'atelier ou il fallait dévelloper un jeux sur les différence et donc on a concu un jeu ou le but est de faire une forge avec asser de diversité pour pouvoir avoir asser de production pour gagner...",
            "CompleteDescription":"Ce jeu a pour but de montrer aux joueurs que la diversité est importante et parfois nécessaire. Pour ce faire, les joueurs s'affrontent dans un match en 1v1 où ils doivent recruter des employés et utiliser des cartes utilitaires pour obtenir l'avantage sur leur adversaire. Pour encourager la diversité, il y a trois races disponibles : les Gobelins, les Amphibiens et les Ogres. Chaque race a ses propres types d'expertise, donc il est essentiel de faire un bon mélange, sinon notre forge ne décrochera aucun contrat, ce qui entraînera notre défaite."
        },
        "Bambooza":{
            "CompleteTitle":"Bambooza",
            "SmallDescription": "Bambooza se présente comme une formation interactive dédiée aux individus de 16 ans et plus, travailleurs ou en recherche d'emploi, qui vivent avec des difficultés professionnelles liées au TDAH.",
            "CompleteDescription":"Bambooza se présente comme une formation interactive dédiée aux individus de 16 ans et plus, travailleurs ou en recherche d'emploi, qui vivent avec des difficultés professionnelles liées au TDAH.",
            "ObjectiveSubTitle":"Les objectifs du jeu étaient principalement éducatifs, mais voici certains objectifs et éléments que nous souhaitions que notre jeu possède :",
            "FirstGoal":"- Éduquer les jeunes au TDAH",
            "SecondGoal":"- Soit le fun",
            "MyContributionText":"J'ai créer les jeux (mondes) de la bibliothèque qui est un jeu de carte de mémoire, du volcan qui est un jeu de conaissance et de recherche et le jeu de la jungle qui lui est un jeu de planification de temp."
        
        },
        "ObjectivesOfTheGame":"Objectif du jeux",
        "MyContribution":"Mes Contributions",
        "Screenshots":"Capture d'écran"
    },
    "About":"À propos",
    "AboutMeText":"Je suis un étudiant récemment diplômé en informatique passionné par le développement de jeux vidéo et le gameplay. Mon parcours académique m'a fourni une solide base en programmation et en conception de logiciels, que je suis désireux d'appliquer dans l'industrie du jeu pour créer des expériences de jeu exceptionnelles.",
    "SeeMore": "En Savoir plus",
    "Footer":{
        "QuickLink":"LIENS RAPIDE",
        "Home": "Acceuil",
        "Games": "Jeux",
        "About": "À Propos"
    },
    "LinkToWebsite":"Liens vien le site du jeu"
    
}